Revit 2026 API

# MetalFinishType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetalFinish" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetalFinishType
```
```vb
Public Enumeration MetalFinishType
```
```cpp
public enum class MetalFinishType
```
```fsharp
type MetalFinishType
```

| Member name | Value | Description |
| --- | --- | --- |
| Brushed | 3 |  |
| Polished | 0 |  |
| Satin | 2 |  |
| SemiPolished | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace